import streamlit as st
import time

page_bg_img = '''<style>
.stApp {
    background-image: url("https://th.bing.com/th/id/R.39bb45986c96676b0b5482ce6c04567c?rik=KnK3H2kEGX7MHA&riu=http%3a%2f%2fwww.pixelstalk.net%2fwp-content%2fuploads%2f2016%2f08%2fHD-1920x1080-Anime-Background.jpg&ehk=0Oc0%2bvsuPqQLtU4jz0RclzGurvnzbLZtQaxQDggz0as%3d&risl=&pid=ImgRaw&r=0");
    background-size: cover;
}
</style>'''

st.markdown(page_bg_img, unsafe_allow_html=True)

st.title("Top :green[Anime]:sunglasses:")
st.markdown("**ประวัติของอนิเมะญี่ปุ่น**")
st.image("https://wallpapercave.com/wp/wp3916518.jpg")

st.header("จุดเริ่มต้น")

st.write("อนิเมะถือเป็นหนึ่งในวัฒนธรรมย่อยของญี่ปุ่นอนิเมะในสมัยก่อนนั้นถูกคิดว่ามีไว้ให้สำหรับเด็กดูแต่ในสมัยนี้ได้กลายเป็นว่าไม่ว่าวัยไหนตั้งแต่เด็กไปจนถึงผู้ใหญ่ก็สามารถเพลิดเพลินได้")
st.write("กล่าวกันว่าอะนิเมะที่เก่าที่สุดนั้นเป็นหนังอนิเมชั่นสั้น ๆ ที่ถูกสร้างขึ้นในปี ค.ศ.1917 ถูกนำมาออกอากาศทางโทรทัศน์ในปี ค.ศ. 1953")
st.write("ในปี ค.ศ. 1963 -Astroboy เจ้าหนูปรมาณู- ก็ได้ออกอากาศแล้วก็ได้รับความนิยมเป็นอย่างมาก")
st.write("อนิเมะของญี่ปุ่นนั้นมีหลากหลายประเภท ไม่เพียงแต่ที่เป็นฮีโร่เท่านั้นแต่ยังมีอีกหลากหลายประเภทเช่น ต่อสู้, ตลก, ความรักและกีฬา เป็นต้น")

st.header("เพลงประกอบก็ได้รับความนิยม")

st.write("มีนักร้องเพลงป๊อปของญี่ปุ่นที่ร้องเพลงประกอบอนิเมะเช่นกันจึงทำให้คนที่ถึงแม้ว่าจะไม่ได้เป็นแฟนของอนิเมะก็กลายมาเป็นที่รู้จักและเป็นแฟนอนิเมะจากเพลงประกอบอนิเมะด้วย เช่น เพลง IDOL - YOASOBI ที่ใครๆก็รู้จักถึงแม้จะไม่ได้ดูอนิเมะก็ตาม")

st.video("https://www.youtube.com/watch?v=ZRtdQ81jPUQ")

st.header("อันดับ1ตลอดกาล")

st.markdown("One Piece")
st.write("วันพีซ (ญี่ปุ่น: ワンピース; โรมาจิ: Wan Piesu; ทับศัพท์: ในชื่ออังกฤษ One Piece) เป็น การ์ตูนญี่ปุ่นเขียนโดย เออิจิโระ โอดะ เรื่องราวของการตามหา -วันพีซ- โดยผู้ที่ได้มาครอบครองจะได้เป็นจ้าวแห่งโจรสลัด เริ่มลงตีพิมพ์ในนิตยสาร โชเน็นจัมป์ ของสำนักพิมพ์ ชูเอฉะ ตั้งแต่ปี พ.ศ. 2540 และเนื่องจากความโด่งดัง วันพีซ จึงได้รับการดัดแปลงเป็น อนิเมะ นวนิยาย รวมไปถึง เกม อีกหลายภาคด้วยกัน")
st.image("https://upload.wikimedia.org/wikipedia/th/thumb/a/ab/One_Piece%2C_volume_1_thai_version.jpg/220px-One_Piece%2C_volume_1_thai_version.jpg")
st.write("ในประเทศไทย วันพีซได้ลิขสิทธิ์โดย สำนักพิมพ์สยามอินเตอร์คอมิกส์ ตีพิมพ์ลงในนิตยสารการ์ตูน ซี-คิดส์ รายสัปดาห์ ส่วนฉบั นัดทะพง ได้ลิขสิทธิ์โดย Audio & Video Entertainment (เฉพาะภาคแรก) และ ดรีม เอกซ์เพรส (เดกซ์) (ตั้งแต่ภาคแรก) เคยออกอากาศทางฟรีทีวี ช่อง ไอทีวี, ทีไอทีวี, โมเดิร์นไนน์ทีวี, ช่อง 3 และช่อง 7HD และผ่านโทรทัศน์ดาวเทียม ช่องการ์ตูนคลับแชนแนล")
st.write("วันพีซเป็นการ์ตูนที่ได้รับการตีพิมพ์ที่สุดในโลก โดยตีพิมพ์ไปมากกว่า 320 ล้านเล่มทั่วโลกระหว่างปี พ.ศ. 2540 ถึง 2557 จุดเด่นของเรื่องนี้อยู่ที่การที่ผู้วาดได้สร้างสรรค์ความฝันซึ่งต้องการลอยพร้อมกับเหล่ามิตรแท้ในวัยเด็กของหลาย ๆ คนได้อย่างมีเสน่ห์ โดยระหว่างลอยนั้น ลูฟี่และผองเพื่อนต้องเจออุปสรรคในการพิสูจน์เพื่อนแท้มากมาย รวมทั้งได้เรียนรู้เรื่องราวและตำนานของบุคคลต่าง ๆ ที่ผ่านเข้ามาในเนื้อเรื่อง")

st.markdown("- อ่านเพิ่มเติม")
st.write("**https://www.wikiwand.com/**")
st.write("**https://livejapan.com/**")

st.sidebar.markdown("<h1 style='color:green;text-shadow: 2px 2px 8px rgba(0,0,0,0.5);'>จัดตามประเภท</h1>", unsafe_allow_html=True)

if st.sidebar.button("Action / ต่อสู้"):
      with st.spinner('...'):
        time.sleep(1)

      st.header("10 อนิเมะแนว Action")

      st.header("1.One Piece")
      st.image("https://cdn.myanimelist.net/images/anime/1244/138851.jpg")
      st.write("วันพีซ เป็นเรื่องราวในยุคทองของโจรสลัด โจรสลัดทุกคนมีเป้าหมายเดียวกันคือเพื่อค้นหา สมบัติในตำนานที่เรียกว่า -วันพีซ- โดยผู้ที่เคยครอบครองวันพีซนั้นมีอยู่คนเดียวตามที่เปิดเผยคือ ราชาแห่งโจรสลัด โกลด์ ดี โรเจอร์ ซึ่งหลังจากที่ ได้ครอบครองวันพีซแล้ว โกลด์ ดี โรเจอร์ ได้เป็นราชาโจรสลัด ชายผู้ได้ทั้ง ความมั่งคั่ง ชื่อเสียงและอำนาจ ผู้ที่ได้ทุกอย่างในโลกมาครอบครองนั้น ได้สั่งสลายกลุ่ม จากนั้นแยกย้ายกันไปไม่มีใครรู้อีก 1 ปีต่อมา ก็ได้มอบตัวและยอมรับโทษการประหารชีวิตที่เกาะโพลสตาร์ ที่เมืองโล้คทาวน์บ้านเกิดของตน และก่อนตายได้มีคนถามโรเจอร์เรื่องสมบัติของโรเจอร์ โรเจอร์ได้ทิ้งคำพูดสุดท้ายที่เปลี่ยนยุคสมัยของโจรสลัดว่า -สมบัติของฉันน่ะเหรอ อยากได้ก็เอาไปสิ ไปหาเอาเลย ฉันเอาทุกอย่างบนโลกไปไว้ที่นั่นหมดแล้ว- จากนั้นก็ถูกประหารทันที แล้วเหล่าคนดูในลานประหารก็โห่ร้องกันอย่างดีใจ กับคนที่ทราบข่าวก็ออกเดินเรือไปเป็นโจรสลัดกัน โจรสลัดทั้งหลายจึงมุ่งหน้าสู่ แกรนด์ไลน์ เพื่อตามหาวันพีซ จนโลกได้เข้าสู่ยุคสมัยของโจรสลัด 22 ปีกว่าต่อมา เด็กหนุ่มที่ใส่หมวกฟางมีพลังพิเศษจากผลปีศาจ จึงเป็นผู้มีพลังพิเศษ ในวันเกิดอายุ 17 ปี ได้ออกเดินเรือไปเป็นโจรสลัด กับออกรวบรวมพรรคพวกจากการผจญภัยในอีสต์บลู ตอนแรกออกเรือด้วยเรือเล็ก แต่เรือพังเพราะเจอน้ำวน จึงไปซ่อนตัวในถังไม้ พอตื่นเจอกับเด็กที่ชื่อโคบี้ได้ฟังว่าโคบี้ทำงานรับใช้บนเรือโจรสลัดมา 2 ปี โดยมีความฝันอยากเป็นทหารเรือ ลูฟี่จึงได้เตือนสติกับไปกอัลบีดา แล้วบอกพวกโจรสลัดให้เอาเรือเล็กมากับทั้งคู่ออกเรือไปส่งโคบี้ที่เกาะใกล้ ๆ พอไปถึงเกาะโยสึบะ ในเมืองเชล พบว่าถูกปกครองด้วยเผด็จการของทหารเรือที่นำโดยพันเอกมอร์แกน กับเจอโซโลนักล่าค่าหัวที่โดนจับ จึงไปช่วยโซโลกับชวนมาเป็นโจรสลัด จัดการกับมอร์แกน กับช่วยให้โคบี้เข้ากองทัพเรือ แล้วตอนเดินเรือทั้งคู่เกิดหิวลูฟี่ก่อเรื่องจะไปจับนกกิน แต่ดันโดนนกยักษ์จับบนฟ้า พอเจอเกาะจึงตกลงมาที่เมืองออเรนเจอกับ นามิ จอมโจรที่ขโมยสมบัติกับแผนที่เดินเรือไปแกรนด์ไลน์ กับถูกนามิหลอกจับไปต่อรองกับโจรสลัด ตัวตลกบากี้ แล้วพอโซโลมาช่วย ทั้ง 3 ร่วมมือกันจัดการพวกบากี้ กับออกเรือโดยมีนามิเป็นพวก กับออกเรือต่อพอไปถึงเกาะต่อไปคือเกาะเกคโค ที่หมู่บ้านไซรัปเจอ อุซปจอมโกหก แล้วทั้ง 4 คุยกันจนรู้ว่าอุซปคือลูกของยาซปที่เป็นลูกเรือของกลุ่มโจรสลัดผมแดง โดยช่วยอุซปจัดการกับกลุ่มโจรสลัดแมวดำ ที่นำโดยคุโระเพื่อช่วยหมู่บ้าน แล้วอุซปขอเข้าร่วมกับได้เรือคาราเวลที่ชื่อโกอิ้งแมรี่เป็นรางวัลจึงออกเรือ แล้วลูฟี่กับอุซปก่อเรื่องไปยิงโขดหินถล่มโดยที่มีคนนอนพักอยู่ ซึ่งคนที่นอนพักอยู่คือ โจนี่กับโยซาคุ 2 นักล่าค่าหัว พอทราบว่ารู้จักกับโซโลจึงปรับความเข้าใจกัน กับได้เบาะแสเรื่องชายตาเหยี่ยวที่ในภัตตราคารลอยทะเลบาราติเอ จึงเดินเรือไป แล้วลูฟี่ก่อเรื่องพังร้าน ต้องทำงานชดใช้ กับมีรองเชฟคือซันจิ แล้วพอกลุ่มโจรสลัดครีกบุมานำโดย ดอนครีก ลูฟี่ร่วมมือสู้กับซันจิ นามิออกเรือหนีกลับบ้านเกิด พอมิฮอว์ค 1 ใน 7 เจ็ดโจรสลัดมา โซโลไปท้าสู้ผลออกมาแพ้อย่างง่ายดายกับได้บาดแผล กับถูกเตือนสติจนเข้าใจ แล้วที่เหลือออกเรือตามนามิไป จนเหลือแต่ลูฟี่ที่ต้องร่วมมือกับซันจิปกป้องภัตราคาร พอจัดการครีกได้ก็พักฟื้นพอหายดี ก็ออกเรือโดยมีซันจิมาเป็นพวก ไปดกาะโคโนมิ ในหมู่บ้านโคโคยาชิใที่เป็นฐานของกลุ่มโจรสลัดอารอง ที่นำโดยอารอง พอนามิรู้ตัวว่าอารองโดนหลอก กลุ่มหมวกฟางจึงจัดการพวกอารองจนพินาศ หลังจากนั้นก็ออกเรือโดยนามิเป็นลูกเรืออย่างทางการ แล้วก็มุ่งหน้าไปโล้กทาวน์ที่เกาะโพลสตาร์เพื่อเตรียมซื้อของก่อนเข้าแกรนด์ไลน์ พอไปถึงทุกคนเตรียมซื้อของกันเสร็จ แล้วลูฟี่ก่อเรื่องไปยืนบนลานประหารโดนบากี้กับอัลบีดาจับเพื่อเตรียมประหาร โดนเกิดเหตุฟ้าผ่าจนลูฟี่รอด กับทั้งหมดก็หนีจากพันเอกสโมคเกอร์ที่เป็นคนคุมที่นี่ โดยมีชายที่ชื่อดราก้อนมาช่วยไว้ แล้วกลุ่มหมวกฟางก็ออกเรือเดินทางเข้าสู่แกรน์ไลน์")

      st.header("2.Naruto: Shippuuden")
      st.image("https://cdn.myanimelist.net/images/anime/1565/111305.jpg")
      st.write("เป็นเรื่องราวของ อุซึมากิ นารูโตะ เด็กน้อยจากหมู่บ้าน โคโนฮะนาคุเระ โลกแห่งนินจา ที่ได้ถูกจิ้งจอก 9 หางโจมตีและได้ออกอาละวาดทำลายหมู่บ้านผู้คน จนกระทั่งโฮคาเงะรุ่นที่ 4 นามิคาเสะ มินาโตะ หัวหน้าของหมู่บ้านโคโนฮะ ซึ่งเป็นพ่อของ นารูโตะ  ได้สละชีวิตรตัวเองด้วยการการผนึกร่างของปีศาจจิ้งจอกเก้าหางไว้ในร่างของทารกซึ่งก็คือ ลูกชายของเขาเองอีก12ปีผ่านไป นารุโตะได้เติบโตขึ้น ณ หมู่บ้าน โคโนฮะ ร่างกายของนารุโตะได้ผนึกปีศาจจิ้งจอกเก้าหาง และผู้คนต่างรังเกียจเขามาโดยตลอดเนื่องจากเป็นร่างสถิตของปีศาจเก้าหางแต่นารูโตะมีความใฝ่ฝันอยากจะเป็นนินจาผู้ยิ่งใหญ่ ผู้สืบทอดชื่อโฮคาเงะ เรื่องราวของ นินจา ผู้ยิ่งใหญ่จึงได้เริ่มต้นขึ้น")

      st.header("3.Jujutsu Kaisen")
      st.image("https://cdn.myanimelist.net/images/anime/1171/109222.jpg")
      st.write("เล่าถึง อิตาโดริ ยูจิ นักเรียนวัย 15 ปีผู้อาศัยอยู่ในเมืองเซ็นได แม้ว่าเขาเป็นนักเรียนจอมพลัง แต่ก็ปฏิเสธที่จะอยู่ชมรมกีฬาและมาสิงอยู่กับชมรมเรื่องเร้นลับ เขาเป็นคนไปหยิบวัตถุต้องสาปที่เก็บไว้ในศาลของโรงเรียนมาให้กับรุ่นพี่ในชมรมฯ ขณะเดียวกันก็มีนักเรียนไสยเวท เมงุมิ เดินทางมาที่โรงเรียนฯเพื่อรับวัตถุต้องสาปดังกล่าวได้ไปซ่อมผนึกใหม่แต่กลับหาวัตถุดังกล่าวไม่พบ เมงุมิสัมผัสได้ว่าเด็กที่ชื่อยูจิเป็นคนเอาไปและตามยูจิไปที่โรงพยาบาลที่ปู่ของยูจิรักษาตัวอยู่ แต่ยูจิกลับบอกว่าตนได้เก็บไว้แต่กล่อง ส่วนวัตถุในนั้นได้นำไปให้รุ่นพี่แล้ว ซึ่งพวกเขามีกำหนดการแกะผนึกในคืนนี้ในคืนนั้น รุ่นพี่ในชมรมได้แกะผนึกออกมาจึงทำให้วิญญาณต้องสาปต่างพรั่งพรูออกมาทั่วทั้งโรงเรียน ยูจิและเมงุมิได้รีบกลับไปที่โรงเรียนและพบกับวิญญาณต้องสาปมากมายในตึกเรียน และสามารถช่วยรุ่นพี่ออกมาได้ แต่เมงุมิก็ถูกวิญญาณต้องสาปทรงพลังเล่นงานจนเจ็บตัวและอยู่ในสถานการณ์วิกฤต เมงุมิบอกว่าถึงยูจิจะแรงเยอะแค่ไหนแต่ก็ไม่สามารถเอาชนะคำสาปได้ เพราะไม่มีไสยเวทในตัว ยูจิจึงกลืนวัตถุต้องสาปนั้นเข้าไปและกลายเป็นภาชนะของ สุคุนะ")

      st.header("4.Kimetsu no Yaiba")
      st.image("https://cdn.myanimelist.net/images/anime/1286/99889.jpg")
      st.write("เรื่องราวเกิดขึ้นในประเทศญี่ปุ่นยุคไทโช คามาโดะ ทันจิโร่ เป็นเด็กหนุ่มผู้มีจิตใจอ่อนโยนและเฉลียวฉลาด ในฐานะลูกชายคนโตของครอบครัวคนเผาถ่าน เขาจึงเป็นหัวเรี่ยวหัวแรงในการหารายได้เลี้ยงดูครอบครัวจากการเผาถ่านไปขายหลังจากพ่อของเขาเสียชีวิต ทุกสิ่งทุกอย่างได้เปลี่ยนแปลงไปเมื่อมีอสูรบุกเข้ามาสังหารคนในครอบครัวของทันจิโร่ จนหมดสิ้นเหลือแต่เพียงเขาและน้องสาวที่ชื่อเนซึโกะเท่านั้น เนซึโกะที่รอดตายมาได้กลับกลายเป็นได้รับเลือดของอสูรจนกลายเป็นอสูรไป ทว่าก็น่าประหลาดใจที่เธอยังคงมีความรู้สึกนึกคิดและการแสดงอารมณ์อย่างมนุษย์ยิ่งคงหลงเหลืออยู่ หลังจากที่ทันจิโร่ได้ต่อสู้กับโทมิโอกะ กิยู นักล่าอสูรที่เดินทางผ่านมาและต้องการจะฆ่าเนซึโกะที่กลายเป็นอสูรไปแล้ว แต่เมื่อกิยูเห็นเนซึโกะปกป้องทันจิโร่ที่เป็นมนุษย์ กิยูได้จึงไว้ชีวิตเนซึโกะ และเขาจึงทำให้เนซึโกะหมดสติ และเขาจึงให้เนซึโกะคาบกระบอกไม้ไผ่ เอาไว้ในปากของเธอตลอดเวลา เพื่อป้องกันไม่ให้เธอทำร้ายมนุษย์ ทันจิโร่จึงตัดสินใจที่จะเป็นนักล่าอสูรตามคำชักชวนของกิยู เพื่อหาทางทำให้น้องสาวกลับมาเป็นมนุษย์ และกำจัดอสูรที่ฆ่าครอบครัวของเขาให้จงได้")

      st.header("5.One Punch Man")
      st.image("https://cdn.myanimelist.net/images/anime/12/76049.jpg")
      st.write("บนโลกเหนือสิ่งมหัศจรรย์สัตว์ประหลาดและอสูรร้ายได้สร้างความหายนะในเมืองต่างๆ เพื่อต่อสู้ต่อกรกับพวกมัน จึงได้มีการก่อตั้งสมาคมฮีโร่เพื่อหยุดยั้งพวกเขา ไซตามะวีรบุรุษที่ไม่เกี่ยวข้องจากฟากฟ้าของเมือง Z ได้ทำในสิ่งที่กล้าหาญความฝันในวัยเด็กและความบันเทิงของตัวเขา เขาฝึกฝนตัวเองจนถึง3ปีทำให้เขาสามารถเอาชนะคู่ต่อสู้ได้อย่างง่ายดายด้วยเพียงหมัดเดียว จากความสนุกและความบันเทิงกลับกลายเป็นความเบื่อหน่ายกับพลังอำนาจทุกอย่างอันเกินขีดจำกัดของเขาเอง")

      st.header("6.Hunter x Hunter (2011)")
      st.image("https://cdn.myanimelist.net/images/anime/1337/99013.jpg")
      st.write("ฮันเตอร์ ชื่อเรียกของเหล่ามนุษย์ที่มีความสามารถพิเศษในการใช้อานุภาพของเน็นและเอ็น เทียบเคียงกับโลกความจริงนั้นสามารถแปลงความสามารถในความคิดให้กลายมาเป็นอำนาจจริงในรูปแบบนามธรรมและจิตใจ ความนึกคิดให้กลายเป็นของจริงขึ้นมาได้ โลกแห่งนี้มีสมาคมลับที่เรียกกันว่า ฮันเตอร์ x ฮันเตอร์ เพื่อปกครองเหล่า นักรบฮันเตอร์ และมอบหมายภารกิจในการกำจัดหัวขโมยและอาชญากรรมต่างๆ และจัดการคัดเลือกเหล่า ฮันเตอร์หน้าใหม่ทุกปี โดย กอร์น เด็กหนุ่ม 10 ขวบ อาศัยอยู่กับ น้าสาวชื่อ มิโตะ และคุณยาย ในเกาะปลาวาฬ ซึ่งเป็นเกาะเล็ก ๆ ที่ชาวประมงอาศัยอยู่ โดยกอร์น ได้รับรู้เพียงว่า พ่อและแม่ของเขาเสียชีวิตเนื่องจากอุบัติเหตุ โดยการปิดบังของน้าและคุณยาย แต่ทว่าวันหนึ่งกอร์นได้เข้าไปในป่าและถูกหมีจิ้งจอกแม่ลูกอ่อนทำร้าย ขณะที่เข้าตาจนนั้น ฮันเตอร์ ไคท์ ได้เข้ามาช่วยชีวิตไว้ และไคท์ได้เล่าให้กอร์นฟังว่า พ่อของกอร์นนั้นยังไม่ตาย แต่กลับกัน พ่อของกอร์นยังเป็นฮันเตอร์ระดับ 3 ดาวชั้นแนวหน้า และก็เป็นอาจารย์ของเขาด้วย เมื่อกอร์นได้ฟังและรู้ว่าพ่อของเขายังมีชีวิตอยู่ เขาจึงตัดสินใจที่จะออกตามหาพ่อ โดยสิ่งแรกที่เขาตัดสินใจจะทำคือ ต้องเข้าสอบฮันเตอร์ให้ได้")

      st.header("7.Fate/Zero")
      st.image("https://cdn.myanimelist.net/images/anime/1887/117644.jpg")
      st.write("เรื่องราวทั้งหมดจะเกิดขึ้นระหว่างสงครามจอกศักดิ์สิทธิ์ครั้งที่ 4 หรือ 10 ปีก่อนหน้าสงครามจอกศักดิ์สิทธิ์ใน เฟต/สเตย์ไนต์ เป็นเรื่องราวเกี่ยวกับการแย่งชิงจอกศักดิ์สิทธิ์ของเหล่าจอมเวทผู้ซึ่งอัญเชิญข้ารับใช้(servant)หรือที่เรียกกันว่าวิญญาณวีรชน เข้ามาต่อสู้กัน")

      st.header("8.Bleach")
      st.image("https://cdn.myanimelist.net/images/anime/3/40451.jpg")
      st.write("คุโรซากิ อิจิโกะ เด็กมัธยมปลายอายุ 15 ปีผู้มีความสามารถมองเห็นวิญญาณ วันหนึ่งเขาได้พบกับยมทูตหญิงชื่อ คุจิกิ ลูเคีย ในขณะที่เธอกำลังตามล่าฮอลโลว์ตัวหนึ่งและพลาดให้กับฮอลโลว์ตัวนั้น ลูเคียจึงเสนอให้อิจิโกะถ่ายโอนส่วนหนึ่งของแรงดันวิญญาณ (ญี่ปุ่น: Spirit Pressure; โรมาจิ: 霊圧; ทับศัพท์: Reiatsu) ของเธอไป แต่ลูเคียกลับพลาดปล่อยให้แรงดันวิญญาณถูกดูดไปจนหมด อุราฮาร่า คิสึเกะ จึงแนะนำให้ใช้ร่างเทียมเพื่อฟื้นพลังและเพื่อให้อิจิโกะเข้าช่วยงานเจ้าหล่อนในการเป็นยมทูตแทนระหว่างที่เธอพักฟื้นพลังอยู่ในโลกมนุษย์ ตลอดเวลาที่ลูเคียพักฟื้นพลัง ลูเคียใช้ชีวิตเป็นนักเรียนในโรงเรียนเดียวกับอิจิโกะและได้พบกับ ซาโดะ แช้ด ยาสึโทระ อิโนะอุเอะ โอริฮิเมะ และอิชิดะ อุริว ควินซีคนสุดท้ายในฐานะเพื่อนร่วมชั้น แต่ทว่าความผิดปกติของอิจิโกะที่กลายเป็นยมทูต ทำให้อุริวประกาศตนเป็นศัตรู และท้าแข่งกำจัดฝูงฮอลโลว์กับอิจิโกะ เหตุการณ์ในครั้งนั้นพลังฟูลบริงเกอร์ของซาโดะ และอิโนะอุเอะตื่นขึ้นโดยไม่ทันตั้งตัว และทั้งสี่ก็เอาชนะฝูงฮอลโลว์ได้อย่างยากเย็น")

      st.header("9.Vinland Saga")
      st.image("https://cdn.myanimelist.net/images/anime/1500/103005.jpg")
      st.write("เป็นเรื่องราวในคริสต์ศตวรรษที่ 11 ในทวีปยุโรป ยุคที่ไวกิ้งออกอาละวาดไปทั่ว Thorfinn ตัวเอกของเรื่องมีพ่อเคยเป็นแม่ทัพใหญ่ที่เบื่อสงครามจึงแกล้งตายและผันตัวมาเป็นชาวสวน แต่กลับถูกพบตัวแล้วโดนเรียกตัวกลับไปร่วมสงคราม แต่ระหว่างทางเขาถูก Askeladd และอดีตเพื่อนร่วมรบจู่โจมจนเสียชีวิต Thorfinn จึงสาบานจะล้างแค้นให้กับพ่อของเขา")

      st.header("10.JoJo's Bizarre Adventure")
      st.image("https://cdn.myanimelist.net/images/anime/3/40409.jpg")
      st.write("เนื้อเรื่องกล่าวถึง โจนาธาน โจสตาร์ โจโจ้ คนแรกในซีรีส์ เป็นลูกโทนในตระกูลโจสตาร์ ซึ่งเป็นตระกูลขุนนางผู้ดีอังกฤษ และ ดิโอ บรันโด (Dio Brando)ระหว่าที่ดิโอ บรันโดกำลังรูดทรัพย์รถม้าของจอร์จ โจสตาร์ ที่ได้ตกหน้าผา เมื่อจอร์จได้คืนสติจึงคิดว่าดาริโอเป็นผู้ช่วยตนและได้มอบแหวนของภรรยาที่ตายให้กับดาริโอเพื่อไปประกอบอาชีพ แต่เมื่อดาริโอป่วยใกล้ตายอย่างมีเงื่อนงำจึงอ้างสิทธิ์ของผู้มีพระคุณให้ดิโอ บรันโด ลูกชายเข้ามายังตระกูลโจสตาร์เพื่อครอบครองสมบัติของตระกูลโจสตาร์และสืบทอดตระกูลบรันโดต่อไป และจอร์จยินดีรับดิโอเข้ามาเป็นบุตรบุญธรรม รวมถึงรับเลี้ยงดิโออย่างเท่าเทียมเสมอโจนาธาน(โจโจ้) ลูกของตน ทั้งคู่ต่างมีความคล้ายคลึงกันในบุคลิกและความสามารถ แต่ลักษณะของความคิดและนิสัยกลับแตกต่างกันโดยสิ้นเชิง ดิโอมักจะหาโอกาสกลั่นแกล้งโจโจ้เสมอทันทีที่มีโอกาสทุกครั้ง แม้แต่เอริน่า เพนเดิลตันหญิงสาวที่ที่โจโจ้รักก็ตาม เมื่อโตขึ้น โจนาธาน โจสตาร์ได้ทำวิทยานิพนธ์เกี่ยวกับอารยธรรมโบราณ และสนใจในหน้ากากศิลา จนกระทั่งเมื่อโจโจ้รู้ความลับอันดำมืดของดิโอที่พยายามฆาตกรรมพ่อของตนเหมือนที่ทำกับพ่อของเขา โจโจ้จึงออกตามหาพ่อค้าชาวจีนผู้ขายยาให้ดิโอ และได้พบกับสปีดวาก้อน ดิโอสูญสิ้นโอกาสและความหวังที่ตั้งใจไว้ ต่อมาดิโอได้แอบเข้าไปค้นหาหน้ากากศิลา และค้นพบความลับของหน้ากากศิลาด้วยความบังเอิญ แต่ก็ยังไม่ได้ใช้หน้ากากนั้น เมื่อโจโจ้ได้ตัวพ่อค้าชาวจีนจึงเดินทางกลับพร้อมสปีดวาก้อน ทุกคนรู้ความลับและเข้าจับกุมดิโอ ดิโอจึงตัดสินใจสวมหน้ากากศิลา และได้รับพลังจากหน้ากากศิลา ทำให้กลายเป็นผีดิบ โจโจ้จึงเข้าต่อสู้ และชนะอย่างหวุดหวิด ได้พบกับเอริน่า แพดเดิลตัน คนรักเก่า และได้พบกับวิล แอนโทนิโอ เซเปลี่ ผู้รู้ความลับหน้ากากศิลา และได้สอนพลังคลื่นมนตราให้เพื่อต่อสู้กับผีดิบ จนกระทั่งรู้ว่าดิโอยังไม่ตาย พวกโจโจ้จึงออกเดินทางไปยังเมืองวินไนส์ และได้เข้าต่อสู้กับผีดิบ เช่น แจ็ค เดอะริปเปอร์ ทัลกัสและบรูฟอร์ด บรูฟอร์ดเป็นคนแรกที่พุ่งเข้าต่อสู้กับโจโจ้ แต่เขาก็สามารถรับมือได้ด้วยไหวพริบ และพลังคลื่นมนตรา บรูฟอร์ดชื่นชมในความกล้าของโจโจ้ จึงมอบดาบไว้ให้ก่อนสิ้นใจตาย ในการต่อสู้กับทัลกัส เซเปลี่พลาดท่า ถูกฆ่าตาย ก่อนตายได้ให้พลังสุดท้ายกับโจโจ้ จึงสามารถล้มทัลกัสได้ ระหว่างได้พบกับอาจาร์ยทอนเปตี้ผู้สอนพลังคลื่นมนตราให้เซเปลี่และลูกศิษย์ ไดเออร์และสเตรโซ ทั้งหมดได้เดินทางไปที่ปราสาทเพื่อปราบดิโอพร้อมกับช่วยชีวิตพี่สาวของเด็กคนนึงเอาไว้ แต่ระหว่างต่อสู้กัน ไดเออร์ถูกดิโอฆ่าตาย แต่โจโจ้ก็กำจัดดิโอได้สำเร็จ หลายวันต่อมาโจโจ้ได้แต่งงานกับเอริน่าแล้วทั้งคู่ก็ได้เดินทางไปอเมริกาเพื่อฮันนีมูน แต่การเดินทางนั้นก็สิ้นสุดลง เมื่อดิโอปรากฏตัวอีกครั้งพร้อมกับฆ่าโจโจ้เพื่อเอาร่างกายของโจโจ้มาใช้ ก่อนตายโจโจ้ให้เอริน่าหนีไปพร้อมกับเด็กทารกที่ยังมีชีวิตอยู่และลูกที่อยู่ในครรภ์ของเธอ หลังเอริน่าหนีไป โจโจ้ก็จากไปอย่างสงบพร้อมกับกอดหัวของดิโอเอาไว้เพื่อให้ตายพร้อมกัน")
      
      st.header("อ่านเพิ่มเติมได้ที่")
      st.markdown("**https://myanimelist.net/**")

if st.sidebar.button("Romance / รักใคร่"):
      with st.spinner('...'):
        time.sleep(1)

      st.header("10 อนิเมะแนว Romance")

      st.header("1.Kaguya-sama: Love is War")
      st.image("https://cdn.myanimelist.net/images/anime/1295/106551.jpg")
      st.write("ประธานสภานักเรียน ชิโรกาเนะ มิยูกิ และรองประธาน ชิโนมิยะ คางุยะ ดูเหมือนจะเป็นคู่ที่สมบูรณ์แบบ คางุยะเป็นลูกสาวของครอบครัวเจ้าของเครือบริษัทที่ร่ำรวย และมิยูกิเป็นนักเรียนดีเด่นของโรงเรียนซึ่งมีชื่อเสียงเป็นที่รู้จักทั่วทั้งจังหวัด แม้ว่าทั้งคู่จะชอบกันและกัน แต่ทั้งคู่กลับมีทิฐิสูงเกินกว่าที่ยอมสารภาพรักกับอีกฝ่าย เพราะทั้งคู่เชื่อว่าคนที่ฝ่ายสารภาพรักก่อนจะเป็นฝ่ายแพ้ การ์ตูนเรื่องนี้เป็นเรื่องราวการวางแผนต่าง ๆ หลากหลายแผนของทั้งคู่ที่จะทำให้อีกฝ่ายสารภาพรักก่อน")

      st.header("2.Kimi ni Todoke")
      st.image("https://cdn.myanimelist.net/images/anime/1502/124384.jpg")
      st.write("คุโรนุมะ ซาวาโกะ ถูกเรียกว่า ซาดาโกะ จากเพื่อนร่วมห้องของเธอ เนื่องจากความคล้ายคลึงกันกับตัวละครในเรื่องเดอะริงส์ ซึ่งซาวาโกะ ถูกคนรอบข้างหวาดกลัวและเข้าใจผิดมาตลอด เนื่องจาก รูปลักษณ์ภายนอกที่ดูน่ากลัวของเธอ มีข่าวลือว่าซาวาโกะมีพลังสัมผัสวิญญาณแก่กล้าและสามารถสาปแช่งผู้คนได้ จริง ๆ แล้ว รูปลักษณ์ภายในของเธอต่างจากภายนอกมาก เพราะเธอเป็นคนอ่อนหวานและขี้อาย ซ้ำเธอยังต้องการเป็นเพื่อนกับทุก ๆ คน เมื่อเด็กหนุ่มยอดนิยมอย่าง คาเสะฮายะ ได้เข้ามาพูดคุยกับเธออย่างเป็นธรรมชาติ ไม่หวาดกลัวเธอ ทุกสิ่งทุกอย่างของเธอได้เปลี่ยนไป เธอพบว่าเหมือนเธอได้เริ่มต้นชีวิตอยู่ในโลกใหม่ที่สดใส พยายามที่จะผูกมิตรกับผู้คนและพูดคุยกับคนมากขึ้น หลังจากนั้นเธอก็มี คาเสะฮายะ เป็นต้นแบบ เธออยากเป็นเหมือน คาเสะฮายะ ที่พูดคุยกับทุกคนได้อย่างเป็นธรรมชาติและสดใสร่าเริง ในขณะเดียวกันความรักของทั้งสองก็กำลังเพิ่มพูนขึ้นอย่างช้า ๆ")

      st.header("3.Toradora!")
      st.image("https://cdn.myanimelist.net/images/anime/13/22128.jpg")
      st.write("ทาคาสุ ริวจิ เด็กหนุ่มผู้มีสายตาอันน่ากลัวจนหลายคนคิดว่าเป็นคนเกเร ในวันขึ้นชั้น ม.ปลายปี 2 ได้ชนกับ ไอซากะ ไทกะ ถึงเธอจะดูน่ารัก แต่ดันเป็นเด็กสาวที่น่ากลัวและชอบอาละวาดจนทุกคนเรียกเธอว่า “เสือมือถือ”")

      st.header("4.Love, Chunibyo & Other Delusions!")
      st.image("https://cdn.myanimelist.net/images/anime/12/46931.jpg")
      st.write("เริ่มมาจากเด็กผู้ชายคนหนึ่งที่ชื่อ โทงาชิ ยูตะ นักเรียนชั้นมัธยมปลาย ในครั้งที่เขาเรียนอยู่โรงเรียนมัธยมต้น เขาเป็นโรคเพ้อฝันจากความเป็นจริง (ญี่ปุ่น: 中二病; โรมาจิ: chūnibyō; ทับศัพท์:  ภาวะป่วยของนักเรียน ม.ต้น ปี 2) โดยคิดว่าเขามีพลังพิเศษที่ได้รับมา และเรียกตัวเองว่า Dark Flame Master ทำให้เขารู้สึกแปลกแยก และเมื่อหลุดพ้นจากภาวะดังกล่าว เขารู้สึกอายทุกครั้งและพยายามจะลืม ๆ มันไปให้หมด และเริ่มต้นชีวิตใหม่ในโรงเรียนมัธยมปลาย แต่แล้วเขาก็ต้องมาพบกับ ทาคานาชิ ริกกะ ที่มีภาวะเพ้อฝันอยู่คนเดียวเช่นเดียวกับเขาในสมัยก่อน ซึ่งเธอรู้ว่าเขาก็เคยชอบในเรื่องพลังพิเศษแบบเดียวกับเธอเช่นกัน จึงเกาะติดเขาอยู่บ่อย ๆ และทำให้ชีวิตเขาวุ่นวายขึ้น")

      st.header("5.My Little Monster")
      st.image("https://cdn.myanimelist.net/images/anime/4/39779.jpg")
      st.write("เรื่องราวนักเรียนมัธยมปลาย 2 คนและเป็นเพื่อนร่วมชั้นกัน มิซุทานิ ชิซุคุ (Mizutani Shizuku) ผู้หญิงที่สนใจแต่เรื่องเรียน ขณะเดียวกันโยชิดะ ฮารุ (Yoshida Haru) หนุ่มเจ้าปัญหาของโรงเรียนที่มักก่อเรื่องไม่เว้นแต่ละวันจนสร้างความลำบาก ใจให้กับคนอื่นๆ แต่เขากลับดันมานั่งข้าง ชิซุคุ จนเกิดเรื่องวุ่นวายตามมาไม่ขาดสาย")

      st.header("6.Loving Yamada at Lv999")
      st.image("https://cdn.myanimelist.net/images/manga/2/228144.jpg")
      st.write("เรื่องราวของ “คิโนชิตะ อาคาเนะ” สาวนักศึกษาที่เพิ่งถูก “ทาคุมะ” แฟนหนุ่มบอกเลิกเพราะไปรักสาวอื่นในเกม นั่นทำให้เธอหาทางคลายเครียดด้วยการเข้าไปเล่นเกมออนไลน์ แต่กลายเป็นว่าพอเล่นเกมไป เธอกลับเครียดหนักกว่าเก่าเพราะเพื่อนในกิลด์ที่ชื่อ “ยามาดะคุง” หลังจากนั้นวันหนึ่ง เธอก็ได้ไปงานอีเวนต์ของเกมที่เล่น ไม่รู้โชคชะตานำพาหรือยังไง เธอดันพบกับหนุ่มหล่อที่ตรงสเป็กของเธอมาก ใช่แล้ว… หนุ่มหล่อคนนั้นก็คือ “ยามาดะคุง” ที่ทำเธอเครียดในเกมนั่นเอง")

      st.header("7.Teasing Master Takagi-san")
      st.image("https://cdn.myanimelist.net/images/anime/1591/95091.jpg")
      st.write("นิชิคาตะ นักเรียนมัธยมชาย ที่มักถูกเพื่อนสาวข้างโต๊ะของเขา ทาคากิ แกล้งอยู่เป็นประจำ เขาจึงคิดหาวิธีแกล้งกลับ โดยหวังว่าจะชนะเธอได้สักวันหนึ่ง")

      st.header("8.Nisekoi")
      st.image("https://cdn.myanimelist.net/images/anime/13/75587.jpg")
      st.write("Raku Ichijou นักเรียนปีแรกของ Bonyari High School เป็นทายาทคนเดียวของครอบครัวยากูซ่าที่น่ากลัว สิบปีที่ผ่านมา Raku สัญญากับเพื่อนในวัยเด็กของเขา ตอนนี้สิ่งที่เขาต้องการต่อไปคือจี้ที่มีล็อคซึ่งสามารถปลดล็อคได้ด้วยกุญแจที่หญิงสาวใช้กับเธอเมื่อเธอแยกจากกัน")

      st.header("9.ReLIFE")
      st.image("https://cdn.myanimelist.net/images/anime/3/82149.jpg")
      st.write("ถูกไล่ออกเสมือนผู้แพ้ที่ไม่มีความหวังโดยผู้คนรอบตัว Arata Kaizaki, อายุ 27 ปี, กระโดดจากงานหนึ่งไปสู่งานอื่นๆ หลังจากที่ออกจาก บริษัทแรกของเขา ความนำอยู่ของเขาก็เปลี่ยนไปอย่างสำคัญเมื่อเขาพบกับ Ryou Yoake, สมาชิกสถาบันการวิจัยเรฟา, ซึ่งให้โอกาสกับ Arata ที่จะเปลี่ยนชีวิตของเขาให้ดีขึ้นด้วยความช่วยเหลือของเม็ดสุดลึก โดยไม่คิด ในระหว่างนั้น Arata Awakens ในวันต่อมาเพื่อค้นพบว่าร่างกายของเขากลับมาเป็นของเด็กชายอายุ 17 ปี")

      st.header("10.Violet Evergarden")
      st.image("https://cdn.myanimelist.net/images/anime/1795/95088.jpg")
      st.write("ในอดีต ดร.ออร์แลนได้สร้างตุ๊กตา (Auto Memory Doll, 自動手記人形) เพื่อช่วยภรรยาที่สูญเสียการมองเห็นพิมพ์นิยายของเธอ ซึ่งกลายเป็นที่นิยมสำหรับประชาชนในภายหลัง ถึงรุ่นแรกจะพัฒนาแค่เปลี่ยนเสียงให้พิมพ์ดีดออกมาเป็นเอกสาร เวลาผ่านไปผู้หญิงที่พิมพ์งานเริ่มเข้ามาแทนที่และถูกเรียกว่าตุ๊กตาเช่นกัน เรื่องราวโฟกัสไปที่ ไวโอเล็ต เอเวอร์การ์เดน อดีตเด็กสาวไร้ชื่อที่ถูกเลี้ยงให้เป็นเครื่องมือในสงคราม ที่มาทำงานในสำนักงานไปรษณีย์ CH รับส่งพิมพ์ข้อความและพัสดุไปถึงผู้รับในฐานะของตุ๊กตา")

      st.header("อ่านเพิ่มเติมได้ที่")
      st.markdown("**https://myanimelist.net/**")

if st.sidebar.button("Fantasy / แฟนตาซี"):
      with st.spinner('...'):
        time.sleep(1)

      st.header("10 อนิเมะแนว Fantasy")

      st.header("1.Mashle")
      st.image("https://cdn.myanimelist.net/images/anime/1218/135107.jpg")
      st.write("ดินแดนเวทมนตร์ สถานที่ที่ไม่ว่าใครก็ใช้เวทมนต์ได้ สถานที่ที่พรสวรรค์ด้านเวทมนตร์เป็นตัวกำหนดทุกสิ่งณ ดินแดนที่ว่านั้น มัช เด็กหนุ่มผู้ฝึกร่างกายเป็นบ้าเป็นหลังอยู่ทุกเมื่อเชื่อวันในป่าห่างไกลผู้คน กลับมีความลับอยู่อย่างหนึ่ง นั่นคือตัวเขาใช้เวทมนต์ไม่ได้ทว่า เมื่อความลับนั้นถูกคนล่วงรู้เข้า ชีวิตของมัชก็พลิกผันไปโดยสิ้นเชิง!!ไม่รู้ด้วยเหตุผลกลใดเขากับถูกจับเข้าโรงเรียนเวทย์มนตร์ แถมยังต้องมุ่งคว้าอันดับท๊อปให้ได้อีก…!?เรื่องราวแฟนตาซีเวทมนตร์สุดพิลึกพิลั่นของเด็กหนุ่มผู้ใช้พลังและกล้ามเนื้อที่ได้จากการฝึกร่างกายมาตลอด เพื่อบทขยี้เวทมนตร์ทุกรูปแบบให้เป็นผุยผงบัตรนี้เปิดมาแล้ว!!")

      st.header("2.No Game No Life")
      st.image("https://cdn.myanimelist.net/images/anime/1074/111944.jpg")
      st.write("โซระและ ชิโระ ฮิคิโคโมริ ผู้เล่นเกมภายใต้ชื่อคูฮาคุโดยเป็นผู้เล่นเกมส์ที่ได้รับชัยชนะเหนือผู้เล่นทั้งหมดในเกม จนในวันหนึ่งทั้งสองได้จดหมายท้าเกมหมากรุกจาก เทโตะ เทพเจ้าในโลกอีกโลกหนึ่ง ซึ่งทั้งสองก็ได้ชนะในการท้าครั้งนี้ และได้รับคำเชิญให้ทั้งสองไปอยู่ในโลกแห่งเกมกระดาน (Disboard) โลกที่เหมาะสมกับพรสวรรค์ของพวกเขา ซึ่งทั้งสองก็ตอบรับไปโดยคิดว่าเป็นแค่เรื่องตลก หลังจากนั้นพวกเขาก็ได้ถูกอัญเชิญไปอยู่ในโลกแห่งนั้น และการผจญภัยต่าง ๆ จึงเริ่มขึ้น")

      st.header("3.Fullmetal Alchemist: Brotherhood")
      st.image("https://cdn.myanimelist.net/images/anime/1208/94745.jpg")
      st.write("เอ็ดเวิร์ด และ อัลฟองเซ เอลริค สองพี่น้องตระกูลเอลริค ต้องสูญเสียแม่ที่รักไปอย่างกะทันหันด้วยโรคระบาด ทั้งคู่จึงตัดสินใจใช้วิชาแปรธาตุในการ “ชุบชีวิตมนุษย์” ซึ่งถือเป็นวิชาต้องห้ามของการเล่นแร่แปรธาตุ เพื่อคืนชีวิตให้กับแม่ของตน แต่ด้วยสัจจะของโลกแล้วไม่สามารถสร้างชีวิตขึ้นมากจากความว่างเปล่าได้ เอ็ดและอัลต้องจ่ายค่าผ่านทางในการรับรู้แก่นแท้โดยแลกด้วยร่างกาย เอ็ดจ่ายด้วยขา ส่วนอัลจ่ายด้วยร่างกายทั้งหมด เมื่อกลับขึ้นมากจากประตูสัจจะเอ็ดพบว่าร่างของน้องชายหายไปทั้งหมด จึงจ่ายด้วยแขนและดึงวิญญาณของน้องชายผนึกไว้ในชุดเกราะด้วยตราวงแหวนเลือด")

      st.header("4.Overlord")
      st.image("https://cdn.myanimelist.net/images/anime/7/88019.jpg")
      st.write("เรื่องราวในปี ค.ศ. 2126 ของเกมเมอร์ผู้คลั่งไคล้เกม RPG ออนไลน์คนหนึ่ง หลังจากเขาและเพื่อนๆ ได้ร่วมกันสร้างความยิ่งใหญ่ในโลกของเกม DMMO-RPG (Dive Massively Multiplayer Online Role Playing Game) ชื่อดังอย่าง Yggdrasil จนเมื่อเวลาผ่านไป 12 ปี เกมที่ครั้งหนึ่งเคยโด่งดังก็ถึงคราวที่เซิร์ฟเวอร์ต้องปิดตัวลง เขาจึงกลับมาออนไลน์ยังโลกเสมือนเพื่อรำลึกความหลังกับเหล่ามรดกความทรงจำที่ทุกคนร่วมกันสร้างเป็นครั้งสุดท้าย ")

      st.header("5.Sword Art Online")
      st.image("https://cdn.myanimelist.net/images/anime/11/39717.jpg")
      st.write("คิริงายะ คาสึโตะ เขาได้เข้าร่วมเล่น เกม เสมือนจริงที่มีชื่อว่า Sword Art Online หรือ SAO ซึ่งเมื่อเขาเล่นเกมส์ ต้อง พบว่าตนเอง ไม่สามารถลอ็กเอาท์ออกจากเกมได้ เหล่าผู้เล่นเกมทั้งหมดต้องติด อยู่ภายในเกม โดยไม่มีใครรู้ว่าผู้พัฒนาเกมมีเป้าหมายที่แท้จริงอย่างไรกันแน่!!! แต่ทางออกจากเกมนี้ไปได้มีเพียงต้องเคลียร์เกมได้สำเร็จ หรือโอเวอร์ในเกม ก็หมาย ถึง การตายของผู้เล่นที่เกิดขึ้นจริง ดังนั้นเพื่อตอบสนองเงื่อนไขของการเคลียร์เกมนี้และ ออก จากโลกเสมือนจริง คาสึโตะจึงต้องเคลียร์เกมนี้ให้สำเร็จให้ได้ หรือเขาต้องพบ กับความตาย!")

      st.header("6.The Rising of the Shield Hero")
      st.image("https://cdn.myanimelist.net/images/anime/1490/101365.jpg")
      st.write("นาโอฟูมิ เด็กหนุ่มสุดแสนธรรมดาที่ถูกอัญเชิญไปต่างโลก เพื่อทำภารกิจพิชิตคลื่นหายนะถึงจะกลับโลกเดิมได้ ทุกคนที่ถูกอัญเชิญมาจะได้รับอาวุธในตำนาน แต่พระเอกกลับได้เพียงโล่ อาวุธที่อ่อนแอที่สุด พระเอกจึงออกเดินทางเก็บเวลพร้อมกับเพื่อนพ้อง แต่ผ่านไปเพียง 3 วัน ก็ถูกเพื่อนหักหลัง ทุกคนในเมืองต่างคิดว่าพระเอกเป็นปีศาจโล่ ทำให้ไม่มีใครเชื่อใจในตัวพระเอกอีกเลย พระเอกจึงต้องดิ้นรนให้ตัวเองแกร่งขึ้นและมีชีวิตรอดกลับไปโลกปกติให้ได้")

      st.header("7.Tensei shitara Slime Datta Ken")
      st.image("https://cdn.myanimelist.net/images/anime/1069/123309.jpg")
      st.write("มิคามิ ซาโตรุ  หนุ่มโสด ไม่เคยมีแฟน วัย 37 ปี ถูกแทงตายเพราะช่วยเพื่อนจากคนร้าย เขาได้เกิดใหม่ในต่างโลกด้วยร่างของสไลม์ ได้พบมังกร เวรุโดร่า ผู้ถูกผนึกมาร่วม 3 ร้อยปีและรู้ว่าเขามาจากต่างโลก ด้วยความเบื่อหน่ายในชีวิตจึงยอมเป็นเพื่อนกับสไลม์ ตั้งชื่อให้เขา “ริมุรุ” และให้เขากลืนตนเข้าไปในร่าง ด้วย 2 ความสามารถ “นักล่า” ที่ทำให้เขาสามารถชิงความสามารถของผู้ถูกกลืน และ “ปราชญ์ผู้ยิ่งใหญ่” ทำให้เขาเข้าใจเรื่องราวในโลกใหม่ ส่งผลให้เขาพัฒนาเป็นสไลม์ที่น่าเกรงขามต่อเหล่ามอนสเตอร์ทั่วไป")

      st.header("8.Kono Subarashii Sekai ni Shukufuku wo!")
      st.image("https://cdn.myanimelist.net/images/anime/8/77831.jpg")
      st.write("หนุ่มวัยรุ่น คาซึมะ ได้เสียชีวิตอย่างน่าอนาถ เขาได้พบ อควา ผู้เป็นเทพธิดาเสนอการคืนชีพให้กับเขาในโลกแฟนตาซีเสมือนเกมที่ผู้คนลดจำนวนลงจากการรุกรานของจอมมาร แต่เนื่องจากดูถูกคาซึมะไว้เยอะ เขาจึงลากเธอไปด้วย อย่างไรก็ตาม อควา ไม่มีพลังบนโลกแฟนตาซีนั้น คาซึมะ ยังได้สมาชิกร่วมทีมแปลกๆ อย่าง เมกุมิน สาวจอมเวทที่มีพลังเวทรุนแรง แต่อัพแต่เวทเดียวเพื่อความเท่ และ ดัสเนส อัศวินสาวที่ชอบความรุนแรง ทำให้การผจญภัยของคาซึมะดูจะเป็นเรื่องยาก")

      st.header("9.Mushoku Tensei: Isekai Ittara Honki Dasu")
      st.image("https://cdn.myanimelist.net/images/anime/1530/117776.jpg")
      st.write("เรื่องราวของชายชาวญี่ปุ่นอายุ 34 ที่ไม่เอาแต่เก็บตัวอยู่ในห้องและไม่เคยทำงาน จนวันหนึ่งเขาถูกไล่ออกจากบ้าน และตอนที่กำลังเดินไปบนถนนอย่างไร้จุดหมาย เขาก็ได้เห็นนักเรียนมัธยม 3 คน กำลังจะถูกรถบรรทุกชนก็เลยเข้าไปช่วยจนเสียชีวิตแทน พอได้ลืมตาตื่นขึ้นมาอีกครั้ง เขาก็พบว่าตัวเองได้มาเกิดใหม่เป็นเด็กทารกในโลกแฟนตาซี และเพื่อที่จะได้ไม่ต้องพบกับเหตุการณ์แบบชาติที่แล้ว เขาจึงเรียนรู้เรื่องเวทย์ ให้ความสนใจกับครอบครัว และใช้ชีวิตอย่างเอาจริงเอาจังสุดๆ!!")

      st.header("10.Re-ZERO")
      st.image("https://cdn.myanimelist.net/images/anime/1522/128039.jpg")
      st.write("“นัตสึกิ สึบารุ” ที่กลับจากการซื้อของที่ร้านสะดวกซื้อ แต่อยู่ดีๆ ก็ย้ายมามิติอื่น ในขณะเดินหาคำตอบว่าตัวเองอยู่ใดมาได้ยังไง แต่ชีวิตก็ตกอยู่ในอันตรายทันทีเพราะโดนกลุ่มโจรเล่นงาน สึบารุได้รับความช่วยเหลือจากสาวผมเงินปริศนา เพื่อทดแทนบุญคุณชายหนุ่มจึงช่วยเธอตามหาของที่เธอถูกขโมยไป ในขณะที่กำลังจะได้ของคืน ทั้งเขาและเธอกลับถูกฆ่าตาย แต่สึบารุก็พบว่าเขาสามารถย้อนเวลากลับไปในช่วงก่อนเกิดเหตุได้ เขาจึงติดสินใจที่จะใช้พลังนี้เพื่อช่วยเหลือเด็กสาวผู้มีพระคุณออกจากชะตากรรมแห่งความตายให้ได้")

      st.header("อ่านเพิ่มเติมได้ที่")
      st.markdown("**https://myanimelist.net/**")

if st.sidebar.button("Shounen / หนุ่มน้อย"):
      with st.spinner('...'):
        time.sleep(1)

      st.header("10 อนิเมะแนว Shounen")

      st.header("1.One Piece")
      st.image("https://cdn.myanimelist.net/images/anime/1244/138851.jpg")
      st.write("วันพีซ เป็นเรื่องราวในยุคทองของโจรสลัด โจรสลัดทุกคนมีเป้าหมายเดียวกันคือเพื่อค้นหา สมบัติในตำนานที่เรียกว่า -วันพีซ- โดยผู้ที่เคยครอบครองวันพีซนั้นมีอยู่คนเดียวตามที่เปิดเผยคือ ราชาแห่งโจรสลัด โกลด์ ดี โรเจอร์ ซึ่งหลังจากที่ ได้ครอบครองวันพีซแล้ว โกลด์ ดี โรเจอร์ ได้เป็นราชาโจรสลัด ชายผู้ได้ทั้ง ความมั่งคั่ง ชื่อเสียงและอำนาจ ผู้ที่ได้ทุกอย่างในโลกมาครอบครองนั้น ได้สั่งสลายกลุ่ม จากนั้นแยกย้ายกันไปไม่มีใครรู้อีก 1 ปีต่อมา ก็ได้มอบตัวและยอมรับโทษการประหารชีวิตที่เกาะโพลสตาร์ ที่เมืองโล้คทาวน์บ้านเกิดของตน และก่อนตายได้มีคนถามโรเจอร์เรื่องสมบัติของโรเจอร์ โรเจอร์ได้ทิ้งคำพูดสุดท้ายที่เปลี่ยนยุคสมัยของโจรสลัดว่า -สมบัติของฉันน่ะเหรอ อยากได้ก็เอาไปสิ ไปหาเอาเลย ฉันเอาทุกอย่างบนโลกไปไว้ที่นั่นหมดแล้ว- จากนั้นก็ถูกประหารทันที แล้วเหล่าคนดูในลานประหารก็โห่ร้องกันอย่างดีใจ กับคนที่ทราบข่าวก็ออกเดินเรือไปเป็นโจรสลัดกัน โจรสลัดทั้งหลายจึงมุ่งหน้าสู่ แกรนด์ไลน์ เพื่อตามหาวันพีซ จนโลกได้เข้าสู่ยุคสมัยของโจรสลัด 22 ปีกว่าต่อมา เด็กหนุ่มที่ใส่หมวกฟางมีพลังพิเศษจากผลปีศาจ จึงเป็นผู้มีพลังพิเศษ ในวันเกิดอายุ 17 ปี ได้ออกเดินเรือไปเป็นโจรสลัด กับออกรวบรวมพรรคพวกจากการผจญภัยในอีสต์บลู ตอนแรกออกเรือด้วยเรือเล็ก แต่เรือพังเพราะเจอน้ำวน จึงไปซ่อนตัวในถังไม้ พอตื่นเจอกับเด็กที่ชื่อโคบี้ได้ฟังว่าโคบี้ทำงานรับใช้บนเรือโจรสลัดมา 2 ปี โดยมีความฝันอยากเป็นทหารเรือ ลูฟี่จึงได้เตือนสติกับไปกอัลบีดา แล้วบอกพวกโจรสลัดให้เอาเรือเล็กมากับทั้งคู่ออกเรือไปส่งโคบี้ที่เกาะใกล้ ๆ พอไปถึงเกาะโยสึบะ ในเมืองเชล พบว่าถูกปกครองด้วยเผด็จการของทหารเรือที่นำโดยพันเอกมอร์แกน กับเจอโซโลนักล่าค่าหัวที่โดนจับ จึงไปช่วยโซโลกับชวนมาเป็นโจรสลัด จัดการกับมอร์แกน กับช่วยให้โคบี้เข้ากองทัพเรือ แล้วตอนเดินเรือทั้งคู่เกิดหิวลูฟี่ก่อเรื่องจะไปจับนกกิน แต่ดันโดนนกยักษ์จับบนฟ้า พอเจอเกาะจึงตกลงมาที่เมืองออเรนเจอกับ นามิ จอมโจรที่ขโมยสมบัติกับแผนที่เดินเรือไปแกรนด์ไลน์ กับถูกนามิหลอกจับไปต่อรองกับโจรสลัด ตัวตลกบากี้ แล้วพอโซโลมาช่วย ทั้ง 3 ร่วมมือกันจัดการพวกบากี้ กับออกเรือโดยมีนามิเป็นพวก กับออกเรือต่อพอไปถึงเกาะต่อไปคือเกาะเกคโค ที่หมู่บ้านไซรัปเจอ อุซปจอมโกหก แล้วทั้ง 4 คุยกันจนรู้ว่าอุซปคือลูกของยาซปที่เป็นลูกเรือของกลุ่มโจรสลัดผมแดง โดยช่วยอุซปจัดการกับกลุ่มโจรสลัดแมวดำ ที่นำโดยคุโระเพื่อช่วยหมู่บ้าน แล้วอุซปขอเข้าร่วมกับได้เรือคาราเวลที่ชื่อโกอิ้งแมรี่เป็นรางวัลจึงออกเรือ แล้วลูฟี่กับอุซปก่อเรื่องไปยิงโขดหินถล่มโดยที่มีคนนอนพักอยู่ ซึ่งคนที่นอนพักอยู่คือ โจนี่กับโยซาคุ 2 นักล่าค่าหัว พอทราบว่ารู้จักกับโซโลจึงปรับความเข้าใจกัน กับได้เบาะแสเรื่องชายตาเหยี่ยวที่ในภัตตราคารลอยทะเลบาราติเอ จึงเดินเรือไป แล้วลูฟี่ก่อเรื่องพังร้าน ต้องทำงานชดใช้ กับมีรองเชฟคือซันจิ แล้วพอกลุ่มโจรสลัดครีกบุมานำโดย ดอนครีก ลูฟี่ร่วมมือสู้กับซันจิ นามิออกเรือหนีกลับบ้านเกิด พอมิฮอว์ค 1 ใน 7 เจ็ดโจรสลัดมา โซโลไปท้าสู้ผลออกมาแพ้อย่างง่ายดายกับได้บาดแผล กับถูกเตือนสติจนเข้าใจ แล้วที่เหลือออกเรือตามนามิไป จนเหลือแต่ลูฟี่ที่ต้องร่วมมือกับซันจิปกป้องภัตราคาร พอจัดการครีกได้ก็พักฟื้นพอหายดี ก็ออกเรือโดยมีซันจิมาเป็นพวก ไปดกาะโคโนมิ ในหมู่บ้านโคโคยาชิใที่เป็นฐานของกลุ่มโจรสลัดอารอง ที่นำโดยอารอง พอนามิรู้ตัวว่าอารองโดนหลอก กลุ่มหมวกฟางจึงจัดการพวกอารองจนพินาศ หลังจากนั้นก็ออกเรือโดยนามิเป็นลูกเรืออย่างทางการ แล้วก็มุ่งหน้าไปโล้กทาวน์ที่เกาะโพลสตาร์เพื่อเตรียมซื้อของก่อนเข้าแกรนด์ไลน์ พอไปถึงทุกคนเตรียมซื้อของกันเสร็จ แล้วลูฟี่ก่อเรื่องไปยืนบนลานประหารโดนบากี้กับอัลบีดาจับเพื่อเตรียมประหาร โดนเกิดเหตุฟ้าผ่าจนลูฟี่รอด กับทั้งหมดก็หนีจากพันเอกสโมคเกอร์ที่เป็นคนคุมที่นี่ โดยมีชายที่ชื่อดราก้อนมาช่วยไว้ แล้วกลุ่มหมวกฟางก็ออกเรือเดินทางเข้าสู่แกรน์ไลน์")

      st.header("2.Hunter x Hunter (2011)")
      st.image("https://cdn.myanimelist.net/images/anime/1337/99013.jpg")
      st.write("ฮันเตอร์ ชื่อเรียกของเหล่ามนุษย์ที่มีความสามารถพิเศษในการใช้อานุภาพของเน็นและเอ็น เทียบเคียงกับโลกความจริงนั้นสามารถแปลงความสามารถในความคิดให้กลายมาเป็นอำนาจจริงในรูปแบบนามธรรมและจิตใจ ความนึกคิดให้กลายเป็นของจริงขึ้นมาได้ โลกแห่งนี้มีสมาคมลับที่เรียกกันว่า ฮันเตอร์ x ฮันเตอร์ เพื่อปกครองเหล่า นักรบฮันเตอร์ และมอบหมายภารกิจในการกำจัดหัวขโมยและอาชญากรรมต่างๆ และจัดการคัดเลือกเหล่า ฮันเตอร์หน้าใหม่ทุกปี โดย กอร์น เด็กหนุ่ม 10 ขวบ อาศัยอยู่กับ น้าสาวชื่อ มิโตะ และคุณยาย ในเกาะปลาวาฬ ซึ่งเป็นเกาะเล็ก ๆ ที่ชาวประมงอาศัยอยู่ โดยกอร์น ได้รับรู้เพียงว่า พ่อและแม่ของเขาเสียชีวิตเนื่องจากอุบัติเหตุ โดยการปิดบังของน้าและคุณยาย แต่ทว่าวันหนึ่งกอร์นได้เข้าไปในป่าและถูกหมีจิ้งจอกแม่ลูกอ่อนทำร้าย ขณะที่เข้าตาจนนั้น ฮันเตอร์ ไคท์ ได้เข้ามาช่วยชีวิตไว้ และไคท์ได้เล่าให้กอร์นฟังว่า พ่อของกอร์นนั้นยังไม่ตาย แต่กลับกัน พ่อของกอร์นยังเป็นฮันเตอร์ระดับ 3 ดาวชั้นแนวหน้า และก็เป็นอาจารย์ของเขาด้วย เมื่อกอร์นได้ฟังและรู้ว่าพ่อของเขายังมีชีวิตอยู่ เขาจึงตัดสินใจที่จะออกตามหาพ่อ โดยสิ่งแรกที่เขาตัดสินใจจะทำคือ ต้องเข้าสอบฮันเตอร์ให้ได้")

      st.header("3.Naruto: Shippuuden")
      st.image("https://cdn.myanimelist.net/images/anime/1565/111305.jpg")
      st.write("เป็นเรื่องราวของ อุซึมากิ นารูโตะ เด็กน้อยจากหมู่บ้าน โคโนฮะนาคุเระ โลกแห่งนินจา ที่ได้ถูกจิ้งจอก 9 หางโจมตีและได้ออกอาละวาดทำลายหมู่บ้านผู้คน จนกระทั่งโฮคาเงะรุ่นที่ 4 นามิคาเสะ มินาโตะ หัวหน้าของหมู่บ้านโคโนฮะ ซึ่งเป็นพ่อของ นารูโตะ  ได้สละชีวิตรตัวเองด้วยการการผนึกร่างของปีศาจจิ้งจอกเก้าหางไว้ในร่างของทารกซึ่งก็คือ ลูกชายของเขาเองอีก12ปีผ่านไป นารุโตะได้เติบโตขึ้น ณ หมู่บ้าน โคโนฮะ ร่างกายของนารุโตะได้ผนึกปีศาจจิ้งจอกเก้าหาง และผู้คนต่างรังเกียจเขามาโดยตลอดเนื่องจากเป็นร่างสถิตของปีศาจเก้าหางแต่นารูโตะมีความใฝ่ฝันอยากจะเป็นนินจาผู้ยิ่งใหญ่ ผู้สืบทอดชื่อโฮคาเงะ เรื่องราวของ นินจา ผู้ยิ่งใหญ่จึงได้เริ่มต้นขึ้น")

      st.header("4.Death Note")
      st.image("https://cdn.myanimelist.net/images/anime/13/8518.jpg")
      st.write("ยางามิ ไลท์ นักเรียนม.ปลาย หัวดีอันดับหนึ่งของประเทศได้ไปพบ บันทึกมรณะ (เดธโน้ต) ของ ลุค ยมทูตผู้หนึ่งได้ทำให้ได้รับความสามารถพิเศษสามารถฆ่าคนได้ เพียงแค่รู้จักหน้าคนผู้นั้นแล้วเขียนชื่อลงไปในกระดาษของสมุดบันทึกเล่มนั้น โดยผู้ที่ถูกเขียนชื่อจะเกิดอาการหัวใจวาย เสียชีวิตภายในเวลา 40 วินาที ไลท์จึงตัดสินใจจะเปลี่ยนแปลงโลก โดยใช้เดธโน้ตฆ่าอาชญากร ผู้คนจึงขนานนามของผู้ฆ่า (ไลท์) ว่า คิระ (มาจากคำว่า killer ในภาษาอังกฤษ)")

      st.header("5.Black Clover")
      st.image("https://cdn.myanimelist.net/images/anime/2/88336.jpg")
      st.write("ซีรีส์นี้มุ่งเน้นไปที่ อัสตา เด็กหนุ่มกำพร้าที่ถูกทิ้งไว้ให้ได้รับการเลี้ยงดูในสถานเลี้ยงเด็กกำพร้าร่วมกับ ยูโน เพื่อนเด็กกำพร้าของเขา ในขณะที่ทุกคนเกิดมาพร้อมกับความสามารถในการใช้มานาในรูปแบบของพลังเวทมนตร์ อัสตาที่ไม่มีเวทมนตร์จะเน้นไปที่ความแข็งแกร่งทางกายภาพแทน ในทางกลับกัน ยูโนเกิดมาเป็นอัจฉริยะที่มีพลังเวทย์มนตร์มหาศาลและมีความสามารถในการควบคุมเวทมนตร์แห่งลม")

      st.header("6.Bleach")
      st.image("https://cdn.myanimelist.net/images/anime/3/40451.jpg")
      st.write("คุโรซากิ อิจิโกะ เด็กมัธยมปลายอายุ 15 ปีผู้มีความสามารถมองเห็นวิญญาณ วันหนึ่งเขาได้พบกับยมทูตหญิงชื่อ คุจิกิ ลูเคีย ในขณะที่เธอกำลังตามล่าฮอลโลว์ตัวหนึ่งและพลาดให้กับฮอลโลว์ตัวนั้น ลูเคียจึงเสนอให้อิจิโกะถ่ายโอนส่วนหนึ่งของแรงดันวิญญาณ (ญี่ปุ่น: Spirit Pressure; โรมาจิ: 霊圧; ทับศัพท์: Reiatsu) ของเธอไป แต่ลูเคียกลับพลาดปล่อยให้แรงดันวิญญาณถูกดูดไปจนหมด อุราฮาร่า คิสึเกะ จึงแนะนำให้ใช้ร่างเทียมเพื่อฟื้นพลังและเพื่อให้อิจิโกะเข้าช่วยงานเจ้าหล่อนในการเป็นยมทูตแทนระหว่างที่เธอพักฟื้นพลังอยู่ในโลกมนุษย์ ตลอดเวลาที่ลูเคียพักฟื้นพลัง ลูเคียใช้ชีวิตเป็นนักเรียนในโรงเรียนเดียวกับอิจิโกะและได้พบกับ ซาโดะ แช้ด ยาสึโทระ อิโนะอุเอะ โอริฮิเมะ และอิชิดะ อุริว ควินซีคนสุดท้ายในฐานะเพื่อนร่วมชั้น แต่ทว่าความผิดปกติของอิจิโกะที่กลายเป็นยมทูต ทำให้อุริวประกาศตนเป็นศัตรู และท้าแข่งกำจัดฝูงฮอลโลว์กับอิจิโกะ เหตุการณ์ในครั้งนั้นพลังฟูลบริงเกอร์ของซาโดะ และอิโนะอุเอะตื่นขึ้นโดยไม่ทันตั้งตัว และทั้งสี่ก็เอาชนะฝูงฮอลโลว์ได้อย่างยากเย็น")

      st.header("7.My Hero Academia")
      st.image("https://cdn.myanimelist.net/images/manga/1/209370.jpg")
      st.write("มิโดริยะ อิซึคุ เป็นเด็กมัธยมต้นธรรมดาคนหนึ่งที่อยู่ในโลกของผู้คนที่ไม่ธรรมดา เพราะว่าโลกที่เขาอยู่นั้น 80% ของมนุษย์ล้วนมี “อัตลักษณ์” หรือว่าพลังเหนือธรรมชาติ ทว่าอิซึคุนั้นได้มีความฝันอยากเป็น “ฮีโร่” มาตั้งแต่เด็ก ถึงแม้เขาจะโดนเพื่อนล้อหรือรังแกเพราะเหตุผลที่เขาไร้อัตลักษณ์มาตั้งแต่เกิดก็ตาม แต่หลังจากเหตุการณ์วิกฤติวันหนึ่งที่ อิซึคุ ได้พยายามช่วยชีวิตเพื่อนสมัยเด็กของเขาไว้จาก “วิลเลิน” (ผู้ที่ใช้อัตลักษณ์ในทางที่ไม่ดี) นั้น ทำให้ฮีโร่อันดับ 1 ไอดอลของอิซึคุนาม ออลไมท์ ได้เห็นวีรกรรมของอิซึคุ เขาจึงได้ตัดสินใจมอบอัตลักษณ์ของตน นั่นก็คือ “วัน ฟอร์ ออล” แด่อิซึคุ เรื่องราวหลังจากนี้บอกเล่าประสบการณ์ใน “โรงเรียนมัธยมปลายยูเอ” ของอิซึคุและอุปสรรคที่เขาต้องฟันฝ่าก่อนที่จะมาเป็นสุดยอดฮีโร่ด้วยความพยายามของเขาเอง")

      st.header("8.Jujutsu Kaisen")
      st.image("https://cdn.myanimelist.net/images/anime/1171/109222.jpg")
      st.write("เล่าถึง อิตาโดริ ยูจิ นักเรียนวัย 15 ปีผู้อาศัยอยู่ในเมืองเซ็นได แม้ว่าเขาเป็นนักเรียนจอมพลัง แต่ก็ปฏิเสธที่จะอยู่ชมรมกีฬาและมาสิงอยู่กับชมรมเรื่องเร้นลับ เขาเป็นคนไปหยิบวัตถุต้องสาปที่เก็บไว้ในศาลของโรงเรียนมาให้กับรุ่นพี่ในชมรมฯ ขณะเดียวกันก็มีนักเรียนไสยเวท เมงุมิ เดินทางมาที่โรงเรียนฯเพื่อรับวัตถุต้องสาปดังกล่าวได้ไปซ่อมผนึกใหม่แต่กลับหาวัตถุดังกล่าวไม่พบ เมงุมิสัมผัสได้ว่าเด็กที่ชื่อยูจิเป็นคนเอาไปและตามยูจิไปที่โรงพยาบาลที่ปู่ของยูจิรักษาตัวอยู่ แต่ยูจิกลับบอกว่าตนได้เก็บไว้แต่กล่อง ส่วนวัตถุในนั้นได้นำไปให้รุ่นพี่แล้ว ซึ่งพวกเขามีกำหนดการแกะผนึกในคืนนี้ในคืนนั้น รุ่นพี่ในชมรมได้แกะผนึกออกมาจึงทำให้วิญญาณต้องสาปต่างพรั่งพรูออกมาทั่วทั้งโรงเรียน ยูจิและเมงุมิได้รีบกลับไปที่โรงเรียนและพบกับวิญญาณต้องสาปมากมายในตึกเรียน และสามารถช่วยรุ่นพี่ออกมาได้ แต่เมงุมิก็ถูกวิญญาณต้องสาปทรงพลังเล่นงานจนเจ็บตัวและอยู่ในสถานการณ์วิกฤต เมงุมิบอกว่าถึงยูจิจะแรงเยอะแค่ไหนแต่ก็ไม่สามารถเอาชนะคำสาปได้ เพราะไม่มีไสยเวทในตัว ยูจิจึงกลืนวัตถุต้องสาปนั้นเข้าไปและกลายเป็นภาชนะของ สุคุนะ")

      st.header("9.Gintama")
      st.image("https://cdn.myanimelist.net/images/anime/4/50361.jpg")
      st.write("เป็นเรื่องราวเกี่ยวกับซากาตะ กินโทกิ อดีตซามูไรที่ทำอาชีพรับจ้างอิสระพร้อมด้วย ชิมูระ ชินปาจิ และ คางุระ เพื่อหาเงินมาเลี้ยงชีพในยุคที่ซามูไรตกต่ำ เนื่องจากการรุกรานของมนุษย์ต่างดาว เนื้อเรื่องเป็นการผสมผสานระหว่างแนวย้อนยุคและแนววิทยาศาสตร์ ลักษณะแนวเรื่องเป็นแนวตลกและต่อสู้ ในญี่ปุ่น กินทามะเป็นการ์ตูนที่ได้รับความนิยมเป็นอย่างสูง ติดอันดับใน 10 อันดับแรกของการ์ตูนที่มียอดขายสูงสุด กระแสตอบรับของการ์ตูนกินทามะมีทั้งด้านบวกและด้านลบ ด้านบวกคือความชื่นชอบเนื้อหาที่ตลกขบขันและมีเนื้อเรื่องที่สนุกตื่นเต้น")

      st.header("10.Kuroko no Basket")
      st.image("https://cdn.myanimelist.net/images/anime/11/50453.jpg")
      st.write("ในช่วงสามปีที่ผ่านมา Teikou Middle School ได้ครองฉากบาสเก็ตบอลแห่งชาติด้วยแนวตำนาน: รุ่นปาฏิหาริย์ มันประกอบไปด้วยสิ่งมหัศจรรย์ห้าอย่างที่โดดเด่นในกีฬา แต่ ชายผีที่หก โบกมือในเงามืดและช่วยให้ทีมชนะสถานะของเขา ในที่สุดการเติบโตที่ยิ่งใหญ่ของพวกเขาก็เบื่อกีฬาที่พวกเขารักและทำให้พวกเขาแยกกันในโรงเรียนมัธยม")

      st.header("อ่านเพิ่มเติมได้ที่")
      st.markdown("**https://myanimelist.net/**")

if st.sidebar.button("Seinen / วัยรุ่น"):
      with st.spinner('...'):
        time.sleep(1)

      st.header("10 อนิเมะแนว Seinen")

      st.header("1.Berserk")
      st.image("https://cdn.myanimelist.net/images/anime/10/79352.jpg")
      st.write("เนื้อเรื่องเปิดตัว กัทส์ (Guts) นักดาบดำที่มีดาบขนาดมหึมา ตาขวาบอด มีแขนซ้ายเทียมทำด้วยเหล็ก และมีรอยตีตราประทับอยู่ที่ต้นคอ ได้ออกเดินทางตามหา ก็อดแฮนด์ ทั้ง 5 ซึ่งเป็นเจ้าแห่งสาวกปีศาจทั้งปวง โดยกัทส์ได้เดินทางมาถึงเมืองๆหนึ่ง ที่ถูกครอบงำโดย ปราสาทโคกะ (Koka Castle) โดยเจ้าเมืองจะต้องส่งเครื่องบรรณาการทั้งทอง อาหาร รวมทั้งผู้หญิงและเด็กไปเป็นเครื่องสังเวยในปราสาทโคกะ เพื่อแลกกับการที่เมืองจะรอดพ้นจากการถูกทำลาย")

      st.header("2.Vinland Saga")
      st.image("https://cdn.myanimelist.net/images/anime/1500/103005.jpg")
      st.write("เป็นเรื่องราวในคริสต์ศตวรรษที่ 11 ในทวีปยุโรป ยุคที่ไวกิ้งออกอาละวาดไปทั่ว Thorfinn ตัวเอกของเรื่องมีพ่อเคยเป็นแม่ทัพใหญ่ที่เบื่อสงครามจึงแกล้งตายและผันตัวมาเป็นชาวสวน แต่กลับถูกพบตัวแล้วโดนเรียกตัวกลับไปร่วมสงคราม แต่ระหว่างทางเขาถูก Askeladd และอดีตเพื่อนร่วมรบจู่โจมจนเสียชีวิต Thorfinn จึงสาบานจะล้างแค้นให้กับพ่อของเขา")

      st.header("3.Oshi no Ko")
      st.image("https://cdn.myanimelist.net/images/anime/1812/134736.jpg")
      st.write("เรื่องราวของหมอหนุ่มโกโร่ที่ต้องช่วยทำคลอดให้ไอดอลสาวโฮชิโนะ ไอ ซึ่งเป็นไอดอลที่เขาชื่นชอบและคลั่งไคล้มาก ๆ เพราะเธอตั้งท้องอย่างลับ ๆ แต่ในวันที่จะทำคลอดโกโร่ถูกสาวกของไอที่แค้นเรื่องที่เธอตั้งท้องฆ่าตาย และเมื่อรู้สึกตัวอีกก็ได้มาเกิดใหม่เป็นลูกของไอดอลสาวที่เขาชอบ")

      st.header("4.Code Geass")
      st.image("https://cdn.myanimelist.net/images/anime/1032/135088.jpg")
      st.write("ปี ค.ศ. 2010 โลกที่ถูกยึดครองด้วยประเทศมหาอำนาจที่ชื่อว่าบริททาเนียทุกประเทศต่างยอมก้มหัวให้กับกองทัพหุ่นยนต์ประสิทธิภาพสูงที่ชื่อว่า ไนท์แมร์เฟรมแม้แต่ประเทศญี่ปุ่นก็ตกเป็นเมืองขึ้นและถูกเปลี่ยนชื่อให้เป็น Area 11ในขณะที่ชาวบริททาเนียเข้ามาอาศัยในบ้านเรือนที่หรูหรา ใช้ชีวิตสุขสบายต่างกับชาวอีเลเว่น (ญี่ปุ่น) ที่ต้องโดนกดขี่อย่างทารุน จึงทำให้เกิดกลุ่มก่อกบฏขึ้นนำโดยตัวเอกที่ชื่อ ลูลูช แลมเพอร์ลูช หรือ ลูลูช วี บริททาเนีย รัชทายาทลำดับที่ 17ลูกของจักรพรรดิแห่งบริททาเนีย ที่ต้องการแก้แค้นพ่อตัวเองที่ทำให้แม่ต้องตายโดยมีคู่ปรับคืออัศวินแห่งบริททาเนีย คุรุรุกิ สุซาคุ เพื่อนสมัยเด็กของลูลูชผู้ขับไนท์แมร์เฟรม รุ่นที่ 7 แลนสล๊อต และกองกำลังจากรัชทายาทลำดับอื่นๆ")

      st.header("5.Tokyo Ghoul")
      st.image("https://cdn.myanimelist.net/images/anime/1498/134443.jpg")
      st.write("คาเนกิ เคน นักศึกษามหาลัยธรรมดาที่ชอบอ่านหนังสือเป็นชีวิตจิตใจ โดยเขาได้พบกับ คามิชิโระ ริเสะ ในร้านคาเฟ่ อันเทย์คุ ที่ชอบไปประจำ เพราะความชอบที่เหมือนกันทำให้ทั้งคู่สนิทกันได้เร็ว แต่แล้วคืนหนึ่งชีวิตของคาเนกิก็ต้องเปลี่ยนไปตลอดกาล เมื่อความจริงแล้วริเสะคือ กูล สิ่งมีชีวิตที่กินมนุษย์เป็นอาหารนั่นเอง")

      st.header("6.Gurren Lagann")
      st.image("https://cdn.myanimelist.net/images/anime/4/5123.jpg")
      st.write("โลกในเรื่องนี้ มนุษย์ส่วนใหญ่อาศัยกันอยู่ใต้ดิน โดยพื้นพิภพเป็นที่อยู่ของพวก บีสท์แมน ที่สามารถบังคับหุ่นยนต์ กันเม็งได้ เรื่องราวเริ่มต้นจาก... เด็กหนุ่มนามว่า ชิม่อน นักขุดเจาะฝีมือดีประจำหมู่บ้านจีฮาที่วันหนึ่งขุดไปเจอกุญแจสว่านสำหรับเสียบตัว กันเม็ง เข้าให้ ชิม่อนมีเพื่อนสนิทและเป็นลูกพี่ที่เขานับถือที่สุดชื่อ คามินะ เขามีความต้องการที่จะออกจากหมู่บ้านเพื่อขึ้นไปสู่ผืนพิภพที่ตัวเขาเคย ได้เห็นเมื่อยังเป็นเด็ก ชะตากรรมของทั้งคู่ได้เปลี่ยนไปตลอดกาล...")

      st.header("7.Zom 100: Bucket List of the Dead")
      st.image("https://cdn.myanimelist.net/images/anime/1384/136408.jpg")
      st.write("ชายหนุ่มอายุ 24 ปี ที่ถูกกดขี่ทำงานให้กับบริษัทสีดำมายาวนานถึง 3 ปี แถมความรักก็ไม่สมหวัง จนดูคล้าย “ซากศพที่มีชีวิต” แต่การระบาดของซอมบี้ได้เปลี่ยนโลกและฟื้นคืนชีพตัวเขาไปอย่างสิ้นเชิง บุคลิกเดิมที่เป็นบวก ด้านที่เต็มไปด้วยความยุติธรรม และเขามีเป้าหมายที่อยากจะทำ 100 สิ่งก่อนที่จะกลายเป็นซอมบี้")

      st.header("8.Steins;Gate")
      st.image("https://cdn.myanimelist.net/images/anime/1935/127974.jpg")
      st.write("นักวิทยาศาสตร์ที่ลำบาก Rintarou Okabe มีความกระหึ่มในการสำรวจทางวิทยาศาสตร์โดยไม่มีที่สิ้นสุด พร้อมกับเพื่อนของเขาสาว Ditzy ที่ใจดีแต่มั่นใจ Mayuri Shiina และเพื่อนร่วมงาน Itaru Hashida กลุ่มของ Rintarou ได้พบห้องปฏิบัติการสำหรับการสร้างเครื่องมือใหม่ๆ เพื่อหวนว่ามันเป็นสิ่งใหม่ที่ไม้เข้าใจทางเทคโนโลยีที่ผสมผสานกับจิตวิญญาณของมนุษย์ แม้กระนั้น นอกจากคำขู่ศัตรูที่มากมาย ที่สุดของเครื่องมือ ที่โดดเด่น ที่ทริโอ้สร้างขึ้นคือไมโครเวฟที่มีพลังในการแปลงกล้วยเป็นเนยสีเขียว")

      st.header("9.Attack on Titan")
      st.image("https://cdn.myanimelist.net/images/anime/10/47347.jpg")
      st.write("เนื้อเรื่อง ผ่าพิภพไททัน มีศูนย์กลางอยู่ที่อารยธรรมภายในกำแพงวงกลมสามชั้น ความรู้ที่เผยแพร่ในท้องถิ่นบันทึกว่ามันเป็นร่องรอยสุดท้ายของอารยธรรมมนุษย์ที่ยังหลงเหลืออยู่ ผู้อยู่อาศัย (ชาวเอลเดีย) ถูกทำให้เชื่อว่าเมื่อร้อยกว่าปีที่แล้ว มนุษยชาติถูกทำให้เกือบสูญพันธุ์หลังการปรากฏตัวของยักษ์คล้ายมนุษย์ที่มีชื่อว่า ไททัน ที่โจมตีและกินมนุษย์ที่มันมองเห็น มนุษยชาติส่วนที่เหลือหลบซ่อนหลังกำแพงร่วมศูนย์กลางสามแห่ง และดำรงชีวิตอย่างสงบสุขประมาณศตวรรษหนึ่ง ความคิดของคนในกำแพงที่จะออกไปข้างนอกไม่เป็นที่ยอมรับอย่างมากและไม่ส่งเสริม เพื่อต่อสู้กับพวกไททัน")

      st.header("10.Neon Genesis Evangelion")
      st.image("https://cdn.myanimelist.net/images/anime/1314/108941.jpg")
      st.write(" สิบห้าปีหลังจากเหตุการณ์ความหายนะที่รู้จักกันในชื่อผลกระทบครั้งที่สองโลกเผชิญกับภัยคุกคามใหม่: สิ่งมีชีวิตที่ยิ่งใหญ่ที่เรียกว่า Angels บุกโตเกียว -3 ทีละคน มนุษยชาติไม่สามารถป้องกันตัวเองจากทูตสวรรค์แม้จะใช้กระสุนที่ทันสมัยที่สุดและยุทธวิธีทางทหาร ความหวังเดียวสำหรับความรอดของมนุษย์นั้นอยู่ในมือของ Nerv ซึ่งเป็นองค์กรลึกลับที่นำโดย Gondou Ikari เย็น หุ่นยนต์ Humanoid Giants Nerv Opera ขนานนามว่า Evangelions เพื่อต่อสู้กับทูตสวรรค์ขั้นสูงและอุปสรรคการป้องกันการตัดที่รู้จักกันในชื่อสนามก่อการร้ายที่สมบูรณ์แบบ")

      st.header("อ่านเพิ่มเติมได้ที่")
      st.markdown("**https://myanimelist.net/**")

st.sidebar.markdown("<h1 style='color:green;text-shadow: 2px 2px 8px rgba(0,0,0,0.5);'>จัดตาม OP/ED</h1>", unsafe_allow_html=True)

if st.sidebar.button("OP"):
      with st.spinner('...'):
        time.sleep(1)

      st.header("10 Opening โดยผู้สร้าง")

      st.header("1.Ranking of Kings")
      st.video("https://www.youtube.com/watch?v=jYqoa2zBA8s")
      st.write("「裸の勇者」by Vaundy ")

      st.header("2.Jujutsu Kaisen")
      st.video("https://www.youtube.com/watch?v=5yb2N3pnztU")
      st.write("SPECIALZ by King Gnu")

      st.header("3.Frieren:Beyond the Journey's End")
      st.video("https://www.youtube.com/watch?v=QoGM9hCxr4k")
      st.write("YUSHA(Brave) by YOASOBI")

      st.header("4.Attack on Titan")
      st.video("https://www.youtube.com/watch?v=2S4qGKmzBJE")
      st.write("The Rumbling by SIM")

      st.header("5.Demon Slayer")
      st.video("https://www.youtube.com/watch?v=05G4RyT9DjY")
      st.write("Kizuna no Kiseki by Man with a Mission x Milet")

      st.header("6.CHAINSAW MAN")
      st.video("https://www.youtube.com/watch?v=dFlDRhvM4L0")
      st.write("KICK BACK by Kenshi Yonezu")

      st.header("7.Violet Evergarden")
      st.video("https://www.youtube.com/watch?v=ZAKuyZEyZjY")
      st.write("Sincerely by TRUE")

      st.header("8.Fate/stay night [Unlimited Blade Works]")
      st.video("https://www.youtube.com/watch?v=plmXVrCKwnE")
      st.write("Brave Shine by Aimer")

      st.header("9.Fire Force")
      st.video("https://www.youtube.com/watch?v=t0WClcc-aVs")
      st.write("MAYDAY by Coldrain feat. Ryo from CRYSTAL LAKE")

      st.header("10.One Piece")
      st.video("https://www.youtube.com/watch?v=hJgJTTIbMDI")
      st.write("One Day by The ROOTLESS")


if st.sidebar.button("ED"):
      with st.spinner('...'):
        time.sleep(1)

      st.header("1.Vinland Saga")
      st.video("https://www.youtube.com/watch?v=MJCv3mfIvhk")
      st.write("Drown by Milet")

      st.header("2.Frieren: Beyond Journey's End")
      st.video("https://www.youtube.com/watch?v=7pmd0kt3FOs")
      st.write("Anytime Anywhere by Milet")

      st.header("3.CHAINSAW MAN")
      st.video("https://www.youtube.com/watch?v=xIeYK9w03i4")
      st.write("CHAINSAW BLOOD by Vaundy")

      st.header("4.Ranking of Kings")
      st.video("https://www.youtube.com/watch?v=6GbpwQL7vR0")
      st.write("Oz. by Yama")

      st.header("5.Koi Wa Ameagari")
      st.video("https://www.youtube.com/watch?v=A3UJMHp7Q-E")
      st.write("Ref:Rain by Aimer")

      st.header("6.Jujutsu Kaisen")
      st.video("https://www.youtube.com/watch?v=fR0tqhqM7Yg")
      st.write("more than words by 羊文学")

      st.header("7.Koutetsujou no Kabaneri")
      st.video("https://www.youtube.com/watch?v=X21WORLKLrE")
      st.write("ninelie by Aimer")

      st.header("8.Vinland Saga")
      st.video("https://www.youtube.com/watch?v=1cYE0Bm5VKI")
      st.write("Torches by Aimer")

      st.header("9.86 Eighty Six")
      st.video("https://www.youtube.com/watch?v=vMdlbE-MzF8")
      st.write("Avid by SawanoHiroyuki[nZk]:mizuki")

      st.header("10.Fire Force")
      st.video("https://www.youtube.com/watch?v=geE49ne2mQg")
      st.write("Veil by Keina Suda")

